;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                            PC v18.12.4.LTS *
;* Date/Time created: Sat Sep 19 20:39:24 2020                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../EK_TM4C123GXL.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\zachr\workspace_v9\mm\Debug")
dmaControlTable:	.usect	".bss:dmaControlTable",512,1024
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("dmaControlTable")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("dmaControlTable")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$964)
	.dwattr $C$DW$1, DW_AT_location[DW_OP_addr dmaControlTable]
	.dwattr $C$DW$1, DW_AT_decl_file("../EK_TM4C123GXL.c")
	.dwattr $C$DW$1, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$1, DW_AT_decl_column(0x19)

	.data
	.align	1
	.elfsym	dmaInitialized,SYM_SIZE(1)
dmaInitialized:
	.bits		0,8
			; dmaInitialized @ 0


	.dwattr $C$DW$263, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$263, DW_AT_decl_column(0x02)

$C$DW$264	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$264, DW_AT_name("FR_INVALID_NAME")
	.dwattr $C$DW$264, DW_AT_const_value(0x06)
	.dwattr $C$DW$264, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$264, DW_AT_decl_column(0x02)

$C$DW$265	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$265, DW_AT_name("FR_DENIED")
	.dwattr $C$DW$265, DW_AT_const_value(0x07)
	.dwattr $C$DW$265, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$265, DW_AT_decl_column(0x02)

$C$DW$266	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$266, DW_AT_name("FR_EXIST")
	.dwattr $C$DW$266, DW_AT_const_value(0x08)
	.dwattr $C$DW$266, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$266, DW_AT_decl_column(0x02)

$C$DW$267	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$267, DW_AT_name("FR_INVALID_OBJECT")
	.dwattr $C$DW$267, DW_AT_const_value(0x09)
	.dwattr $C$DW$267, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$267, DW_AT_decl_column(0x02)

$C$DW$268	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$268, DW_AT_name("FR_WRITE_PROTECTED")
	.dwattr $C$DW$268, DW_AT_const_value(0x0a)
	.dwattr $C$DW$268, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$268, DW_AT_decl_column(0x02)

$C$DW$269	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$269, DW_AT_name("FR_INVALID_DRIVE")
	.dwattr $C$DW$269, DW_AT_const_value(0x0b)
	.dwattr $C$DW$269, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$269, DW_AT_decl_column(0x02)

$C$DW$270	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$270, DW_AT_name("FR_NOT_ENABLED")
	.dwattr $C$DW$270, DW_AT_const_value(0x0c)
	.dwattr $C$DW$270, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$270, DW_AT_decl_column(0x02)

$C$DW$271	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$271, DW_AT_name("FR_NO_FILESYSTEM")
	.dwattr $C$DW$271, DW_AT_const_value(0x0d)
	.dwattr $C$DW$271, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$271, DW_AT_decl_column(0x02)

$C$DW$272	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$272, DW_AT_name("FR_MKFS_ABORTED")
	.dwattr $C$DW$272, DW_AT_const_value(0x0e)
	.dwattr $C$DW$272, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$272, DW_AT_decl_column(0x02)

$C$DW$273	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$273, DW_AT_name("FR_TIMEOUT")
	.dwattr $C$DW$273, DW_AT_const_value(0x0f)
	.dwattr $C$DW$273, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$273, DW_AT_decl_column(0x02)

$C$DW$274	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$274, DW_AT_name("FR_LOCKED")
	.dwattr $C$DW$274, DW_AT_const_value(0x10)
	.dwattr $C$DW$274, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$274, DW_AT_decl_column(0x02)

$C$DW$275	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$275, DW_AT_name("FR_NOT_ENOUGH_CORE")
	.dwattr $C$DW$275, DW_AT_const_value(0x11)
	.dwattr $C$DW$275, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0xca)
	.dwattr $C$DW$275, DW_AT_decl_column(0x02)

$C$DW$276	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$276, DW_AT_name("FR_TOO_MANY_OPEN_FILES")
	.dwattr $C$DW$276, DW_AT_const_value(0x12)
	.dwattr $C$DW$276, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$276, DW_AT_decl_column(0x02)

$C$DW$277	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$277, DW_AT_name("FR_INVALID_PARAMETER")
	.dwattr $C$DW$277, DW_AT_const_value(0x13)
	.dwattr $C$DW$277, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$277, DW_AT_decl_column(0x02)

	.dwattr $C$DW$T$961, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$961, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$961, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$961

$C$DW$T$962	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$962, DW_AT_name("FRESULT")
	.dwattr $C$DW$T$962, DW_AT_type(*$C$DW$T$961)
	.dwattr $C$DW$T$962, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$962, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$962, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$T$962, DW_AT_decl_column(0x03)


$C$DW$T$135	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$135, DW_AT_byte_size(0x10)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$278, DW_AT_name("pvSrcEndAddr")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("pvSrcEndAddr")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/TivaWare_C_Series-2.1.1.71b/driverlib/udma.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x49)
	.dwattr $C$DW$278, DW_AT_decl_column(0x14)

$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$279, DW_AT_name("pvDstEndAddr")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("pvDstEndAddr")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/TivaWare_C_Series-2.1.1.71b/driverlib/udma.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$279, DW_AT_decl_column(0x14)

$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$280, DW_AT_name("ui32Control")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("ui32Control")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/TivaWare_C_Series-2.1.1.71b/driverlib/udma.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x53)
	.dwattr $C$DW$280, DW_AT_decl_column(0x17)

$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$281, DW_AT_name("ui32Spare")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("ui32Spare")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/TivaWare_C_Series-2.1.1.71b/driverlib/udma.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x58)
	.dwattr $C$DW$281, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$135, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/TivaWare_C_Series-2.1.1.71b/driverlib/udma.h")
	.dwattr $C$DW$T$135, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$135, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$135

$C$DW$T$963	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$963, DW_AT_name("tDMAControlTable")
	.dwattr $C$DW$T$963, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$963, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$963, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/TivaWare_C_Series-2.1.1.71b/driverlib/udma.h")
	.dwattr $C$DW$T$963, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$963, DW_AT_decl_column(0x01)


$C$DW$T$964	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$964, DW_AT_type(*$C$DW$T$963)
	.dwattr $C$DW$T$964, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$964, DW_AT_byte_size(0x200)
$C$DW$282	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$282, DW_AT_upper_bound(0x1f)

	.dwendtag $C$DW$T$964


$C$DW$T$140	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$140, DW_AT_byte_size(0x234)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$283, DW_AT_name("fs_type")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("fs_type")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$283, DW_AT_decl_column(0x07)

$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$284, DW_AT_name("drv")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("drv")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x50)
	.dwattr $C$DW$284, DW_AT_decl_column(0x07)

$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$285, DW_AT_name("csize")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("csize")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x51)
	.dwattr $C$DW$285, DW_AT_decl_column(0x07)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$286, DW_AT_name("n_fats")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("n_fats")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x52)
	.dwattr $C$DW$286, DW_AT_decl_column(0x07)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$287, DW_AT_name("wflag")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("wflag")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x53)
	.dwattr $C$DW$287, DW_AT_decl_column(0x07)

$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$288, DW_AT_name("fsi_flag")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("fsi_flag")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x54)
	.dwattr $C$DW$288, DW_AT_decl_column(0x07)

$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$289, DW_AT_name("id")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x55)
	.dwattr $C$DW$289, DW_AT_decl_column(0x07)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$290, DW_AT_name("n_rootdir")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("n_rootdir")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x56)
	.dwattr $C$DW$290, DW_AT_decl_column(0x07)

$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$291, DW_AT_name("sobj")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("sobj")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$291, DW_AT_decl_column(0x0a)

$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$292, DW_AT_name("last_clust")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("last_clust")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$292, DW_AT_decl_column(0x08)

$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$293, DW_AT_name("free_clust")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("free_clust")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$293, DW_AT_decl_column(0x08)

$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$294, DW_AT_name("n_fatent")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("n_fatent")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x64)
	.dwattr $C$DW$294, DW_AT_decl_column(0x08)

$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$295, DW_AT_name("fsize")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x65)
	.dwattr $C$DW$295, DW_AT_decl_column(0x08)

$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$296, DW_AT_name("volbase")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("volbase")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x66)
	.dwattr $C$DW$296, DW_AT_decl_column(0x08)

$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$297, DW_AT_name("fatbase")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("fatbase")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x67)
	.dwattr $C$DW$297, DW_AT_decl_column(0x08)

$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$298, DW_AT_name("dirbase")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("dirbase")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x68)
	.dwattr $C$DW$298, DW_AT_decl_column(0x08)

$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$299, DW_AT_name("database")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("database")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x69)
	.dwattr $C$DW$299, DW_AT_decl_column(0x08)

$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$300, DW_AT_name("winsect")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("winsect")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$300, DW_AT_decl_column(0x08)

$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$301, DW_AT_name("win")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("win")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$301, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$140, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$140

$C$DW$T$162	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$162, DW_AT_name("FATFS")
	.dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$162, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$162, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$162, DW_AT_decl_column(0x03)

$C$DW$T$163	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$T$163, DW_AT_address_class(0x20)


$C$DW$T$150	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$150, DW_AT_byte_size(0x02)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$302, DW_AT_name("opened")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("opened")
	.dwattr $C$DW$302, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$302, DW_AT_bit_size(0x01)
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$302, DW_AT_decl_column(0x1a)

$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$303, DW_AT_name("readMode")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("readMode")
	.dwattr $C$DW$303, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$303, DW_AT_bit_size(0x01)
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$303, DW_AT_decl_column(0x1a)

$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$304, DW_AT_name("writeMode")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("writeMode")
	.dwattr $C$DW$304, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$304, DW_AT_bit_size(0x01)
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$304, DW_AT_decl_column(0x1a)

$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$305, DW_AT_name("readDataMode")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("readDataMode")
	.dwattr $C$DW$305, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$305, DW_AT_bit_size(0x01)
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$305, DW_AT_decl_column(0x1a)

$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$306, DW_AT_name("writeDataMode")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("writeDataMode")
	.dwattr $C$DW$306, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$306, DW_AT_bit_size(0x01)
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$306, DW_AT_decl_column(0x1a)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$307, DW_AT_name("readReturnMode")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("readReturnMode")
	.dwattr $C$DW$307, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$307, DW_AT_bit_size(0x01)
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$307, DW_AT_decl_column(0x1a)

$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$308, DW_AT_name("readEcho")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("readEcho")
	.dwattr $C$DW$308, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$308, DW_AT_bit_size(0x01)
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$308, DW_AT_decl_column(0x1a)

$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$309, DW_AT_name("bufTimeout")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("bufTimeout")
	.dwattr $C$DW$309, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$309, DW_AT_bit_size(0x01)
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$309, DW_AT_decl_column(0x1a)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$310, DW_AT_name("callCallback")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("callCallback")
	.dwattr $C$DW$310, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$310, DW_AT_bit_size(0x01)
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$310, DW_AT_decl_column(0x1a)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$311, DW_AT_name("drainByISR")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("drainByISR")
	.dwattr $C$DW$311, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$311, DW_AT_bit_size(0x01)
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$311, DW_AT_decl_column(0x1a)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$312, DW_AT_name("rxEnabled")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("rxEnabled")
	.dwattr $C$DW$312, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$312, DW_AT_bit_size(0x01)
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$312, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$150, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/uart/UARTTiva.h")
	.dwattr $C$DW$T$150, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$T$150, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$150


$C$DW$T$151	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$151, DW_AT_byte_size(0x10)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$313, DW_AT_name("__max_align1")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("C:/ti/ccs930/ccs/tools/compiler/ti-cgt-arm_18.12.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$313, DW_AT_decl_column(0x0c)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$314, DW_AT_name("__max_align2")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("C:/ti/ccs930/ccs/tools/compiler/ti-cgt-arm_18.12.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$314, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/ccs930/ccs/tools/compiler/ti-cgt-arm_18.12.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0x79)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$151

$C$DW$T$966	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$966, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$966, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$T$966, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$966, DW_AT_decl_file("C:/ti/ccs930/ccs/tools/compiler/ti-cgt-arm_18.12.4.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$966, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$966, DW_AT_decl_column(0x03)


$C$DW$T$155	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$155, DW_AT_byte_size(0x08)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$315, DW_AT_name("length")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x273)
	.dwattr $C$DW$315, DW_AT_decl_column(0x16)

$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$316, DW_AT_name("elem")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x273)
	.dwattr $C$DW$316, DW_AT_decl_column(0x44)

	.dwattr $C$DW$T$155, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$155, DW_AT_decl_line(0x273)
	.dwattr $C$DW$T$155, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$155

$C$DW$T$967	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$967, DW_AT_name("__ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$967, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$T$967, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$967, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$967, DW_AT_decl_line(0x273)
	.dwattr $C$DW$T$967, DW_AT_decl_column(0x4c)

$C$DW$T$968	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$968, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$968, DW_AT_type(*$C$DW$T$967)
	.dwattr $C$DW$T$968, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$968, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$968, DW_AT_decl_line(0x274)
	.dwattr $C$DW$T$968, DW_AT_decl_column(0x35)

$C$DW$T$969	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$969, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$969, DW_AT_type(*$C$DW$T$968)
	.dwattr $C$DW$T$969, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$969, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$969, DW_AT_decl_line(0x275)
	.dwattr $C$DW$T$969, DW_AT_decl_column(0x31)


$C$DW$T$158	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$158, DW_AT_byte_size(0x08)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$317, DW_AT_name("length")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$317, DW_AT_decl_column(0x16)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$318, DW_AT_name("elem")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$318, DW_AT_decl_column(0x3a)

	.dwattr $C$DW$T$158, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$158, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$158, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$158

$C$DW$T$970	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$970, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$970, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$970, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$970, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$970, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$970, DW_AT_decl_column(0x42)

$C$DW$T$971	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$971, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$971, DW_AT_type(*$C$DW$T$970)
	.dwattr $C$DW$T$971, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$971, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$971, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$971, DW_AT_decl_column(0x2b)

$C$DW$T$972	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$972, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$972, DW_AT_type(*$C$DW$T$971)
	.dwattr $C$DW$T$972, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$972, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$972, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$972, DW_AT_decl_column(0x27)


$C$DW$T$161	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$161, DW_AT_byte_size(0x08)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$319, DW_AT_name("length")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$319, DW_AT_decl_column(0x16)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$320, DW_AT_name("elem")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$320, DW_AT_decl_column(0x3b)

	.dwattr $C$DW$T$161, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$161

$C$DW$T$973	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$973, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$973, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$T$973, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$973, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$973, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$T$973, DW_AT_decl_column(0x43)

$C$DW$T$974	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$974, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$974, DW_AT_type(*$C$DW$T$973)
	.dwattr $C$DW$T$974, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$974, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$974, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$974, DW_AT_decl_column(0x2c)

$C$DW$T$975	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$975, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$975, DW_AT_type(*$C$DW$T$974)
	.dwattr $C$DW$T$975, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$975, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/bios_6_45_01_29/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$975, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$975, DW_AT_decl_column(0x28)


$C$DW$T$165	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$165, DW_AT_byte_size(0x224)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$321, DW_AT_name("fs")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("fs")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x73)
	.dwattr $C$DW$321, DW_AT_decl_column(0x09)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$322, DW_AT_name("id")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x74)
	.dwattr $C$DW$322, DW_AT_decl_column(0x07)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$323, DW_AT_name("flag")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("flag")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x75)
	.dwattr $C$DW$323, DW_AT_decl_column(0x07)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$324, DW_AT_name("err")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("err")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x76)
	.dwattr $C$DW$324, DW_AT_decl_column(0x07)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$325, DW_AT_name("fptr")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("fptr")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x77)
	.dwattr $C$DW$325, DW_AT_decl_column(0x08)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$326, DW_AT_name("fsize")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x78)
	.dwattr $C$DW$326, DW_AT_decl_column(0x08)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$327, DW_AT_name("sclust")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("sclust")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x79)
	.dwattr $C$DW$327, DW_AT_decl_column(0x08)

$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$328, DW_AT_name("clust")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("clust")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$328, DW_AT_decl_column(0x08)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$329, DW_AT_name("dsect")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("dsect")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$329, DW_AT_decl_column(0x08)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$330, DW_AT_name("dir_sect")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("dir_sect")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$330, DW_AT_decl_column(0x08)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$331, DW_AT_name("dir_ptr")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("dir_ptr")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$331, DW_AT_decl_column(0x08)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$332, DW_AT_name("buf")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("buf")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x87)
	.dwattr $C$DW$332, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$165, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$165, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$165

$C$DW$T$976	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$976, DW_AT_name("FIL")
	.dwattr $C$DW$T$976, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$T$976, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$976, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$976, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$976, DW_AT_decl_column(0x03)


$C$DW$T$166	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$166, DW_AT_byte_size(0x1c)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$333, DW_AT_name("fs")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("fs")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x90)
	.dwattr $C$DW$333, DW_AT_decl_column(0x09)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$334, DW_AT_name("id")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x91)
	.dwattr $C$DW$334, DW_AT_decl_column(0x07)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$335, DW_AT_name("index")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("index")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x92)
	.dwattr $C$DW$335, DW_AT_decl_column(0x07)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$336, DW_AT_name("sclust")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("sclust")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x93)
	.dwattr $C$DW$336, DW_AT_decl_column(0x08)

$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$337, DW_AT_name("clust")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("clust")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x94)
	.dwattr $C$DW$337, DW_AT_decl_column(0x08)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$338, DW_AT_name("sect")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("sect")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x95)
	.dwattr $C$DW$338, DW_AT_decl_column(0x08)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$339, DW_AT_name("dir")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("dir")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x96)
	.dwattr $C$DW$339, DW_AT_decl_column(0x08)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$340, DW_AT_name("fn")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("fn")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x97)
	.dwattr $C$DW$340, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$166, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$166, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$166

$C$DW$T$977	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$977, DW_AT_name("DIR")
	.dwattr $C$DW$T$977, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$T$977, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$977, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$977, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$T$977, DW_AT_decl_column(0x03)


$C$DW$T$170	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$170, DW_AT_byte_size(0x18)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$341, DW_AT_name("fsize")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$341, DW_AT_decl_column(0x08)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$342, DW_AT_name("fdate")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("fdate")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$342, DW_AT_decl_column(0x07)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$343, DW_AT_name("ftime")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("ftime")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0xab)
	.dwattr $C$DW$343, DW_AT_decl_column(0x07)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$344, DW_AT_name("fattrib")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("fattrib")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0xac)
	.dwattr $C$DW$344, DW_AT_decl_column(0x07)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$345, DW_AT_name("fname")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("fname")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0xad)
	.dwattr $C$DW$345, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$170, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$170

$C$DW$T$978	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$978, DW_AT_name("FILINFO")
	.dwattr $C$DW$T$978, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$978, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$978, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/ff.h")
	.dwattr $C$DW$T$978, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$978, DW_AT_decl_column(0x03)


$C$DW$T$185	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$185, DW_AT_byte_size(0x14)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$346, DW_AT_name("d_init")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("d_init")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/diskio.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x57)
	.dwattr $C$DW$346, DW_AT_decl_column(0x0f)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$347, DW_AT_name("d_status")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("d_status")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/diskio.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x58)
	.dwattr $C$DW$347, DW_AT_decl_column(0x0f)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$348, DW_AT_name("d_read")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("d_read")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/diskio.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x59)
	.dwattr $C$DW$348, DW_AT_decl_column(0x0f)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$182)
	.dwattr $C$DW$349, DW_AT_name("d_write")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("d_write")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$349, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/diskio.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$349, DW_AT_decl_column(0x0f)

$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$184)
	.dwattr $C$DW$350, DW_AT_name("d_ioctl")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("d_ioctl")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/diskio.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$350, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/diskio.h")
	.dwattr $C$DW$T$185, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$185, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$185

$C$DW$T$979	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$979, DW_AT_name("diskio_fxns")
	.dwattr $C$DW$T$979, DW_AT_type(*$C$DW$T$185)
	.dwattr $C$DW$T$979, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$979, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/mw/fatfs/diskio.h")
	.dwattr $C$DW$T$979, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$979, DW_AT_decl_column(0x03)


$C$DW$T$191	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$191, DW_AT_byte_size(0x04)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$186)
	.dwattr $C$DW$351, DW_AT_name("f")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("C:/ti/ccs930/xdctools_3_60_02_34_core/packages/xdc/std.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$351, DW_AT_decl_column(0x0f)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$190)
	.dwattr $C$DW$352, DW_AT_name("a")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("C:/ti/ccs930/xdctools_3_60_02_34_core/packages/xdc/std.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$352, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/ccs930/xdctools_3_60_02_34_core/packages/xdc/std.h")
	.dwattr $C$DW$T$191, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$T$191, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$191

$C$DW$T$980	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$980, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$980, DW_AT_type(*$C$DW$T$191)
	.dwattr $C$DW$T$980, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$980, DW_AT_decl_file("C:/ti/ccs930/xdctools_3_60_02_34_core/packages/xdc/std.h")
	.dwattr $C$DW$T$980, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$980, DW_AT_decl_column(0x03)


$C$DW$T$981	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$981, DW_AT_name("EK_TM4C123GXL_GPIOName")
	.dwattr $C$DW$T$981, DW_AT_byte_size(0x01)
$C$DW$353	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$353, DW_AT_name("EK_TM4C123GXL_SW1")
	.dwattr $C$DW$353, DW_AT_const_value(0x00)
	.dwattr $C$DW$353, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$353, DW_AT_decl_column(0x05)

$C$DW$354	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$354, DW_AT_name("EK_TM4C123GXL_SW2")
	.dwattr $C$DW$354, DW_AT_const_value(0x01)
	.dwattr $C$DW$354, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$354, DW_AT_decl_column(0x05)

$C$DW$355	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$355, DW_AT_name("EK_TM4C123GXL_LED_RED")
	.dwattr $C$DW$355, DW_AT_const_value(0x02)
	.dwattr $C$DW$355, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$355, DW_AT_decl_column(0x05)

$C$DW$356	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$356, DW_AT_name("EK_TM4C123GXL_LED_BLUE")
	.dwattr $C$DW$356, DW_AT_const_value(0x03)
	.dwattr $C$DW$356, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x40)
	.dwattr $C$DW$356, DW_AT_decl_column(0x05)

$C$DW$357	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$357, DW_AT_name("EK_TM4C123GXL_LED_GREEN")
	.dwattr $C$DW$357, DW_AT_const_value(0x04)
	.dwattr $C$DW$357, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x41)
	.dwattr $C$DW$357, DW_AT_decl_column(0x05)

$C$DW$358	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$358, DW_AT_name("EK_TM4C123GXL_GPIOCOUNT")
	.dwattr $C$DW$358, DW_AT_const_value(0x05)
	.dwattr $C$DW$358, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x43)
	.dwattr $C$DW$358, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$981, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$981, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$981, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$981

$C$DW$T$982	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$982, DW_AT_name("EK_TM4C123GXL_GPIOName")
	.dwattr $C$DW$T$982, DW_AT_type(*$C$DW$T$981)
	.dwattr $C$DW$T$982, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$982, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$982, DW_AT_decl_line(0x44)
	.dwattr $C$DW$T$982, DW_AT_decl_column(0x03)


$C$DW$T$983	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$983, DW_AT_name("EK_TM4C123GXL_I2CName")
	.dwattr $C$DW$T$983, DW_AT_byte_size(0x01)
$C$DW$359	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$359, DW_AT_name("EK_TM4C123GXL_I2C0")
	.dwattr $C$DW$359, DW_AT_const_value(0x00)
	.dwattr $C$DW$359, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$359, DW_AT_decl_column(0x05)

$C$DW$360	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$360, DW_AT_name("EK_TM4C123GXL_I2C3")
	.dwattr $C$DW$360, DW_AT_const_value(0x01)
	.dwattr $C$DW$360, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$360, DW_AT_decl_column(0x05)

$C$DW$361	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$361, DW_AT_name("EK_TM4C123GXL_I2CCOUNT")
	.dwattr $C$DW$361, DW_AT_const_value(0x02)
	.dwattr $C$DW$361, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$361, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$983, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$983, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$983, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$983

$C$DW$T$984	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$984, DW_AT_name("EK_TM4C123GXL_I2CName")
	.dwattr $C$DW$T$984, DW_AT_type(*$C$DW$T$983)
	.dwattr $C$DW$T$984, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$984, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$984, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$984, DW_AT_decl_column(0x03)


$C$DW$T$985	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$985, DW_AT_name("EK_TM4C123GXL_PWMName")
	.dwattr $C$DW$T$985, DW_AT_byte_size(0x01)
$C$DW$362	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$362, DW_AT_name("EK_TM4C123GXL_PWM6")
	.dwattr $C$DW$362, DW_AT_const_value(0x00)
	.dwattr $C$DW$362, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x56)
	.dwattr $C$DW$362, DW_AT_decl_column(0x05)

$C$DW$363	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$363, DW_AT_name("EK_TM4C123GXL_PWM7")
	.dwattr $C$DW$363, DW_AT_const_value(0x01)
	.dwattr $C$DW$363, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x57)
	.dwattr $C$DW$363, DW_AT_decl_column(0x05)

$C$DW$364	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$364, DW_AT_name("EK_TM4C123GXL_PWMCOUNT")
	.dwattr $C$DW$364, DW_AT_const_value(0x02)
	.dwattr $C$DW$364, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x59)
	.dwattr $C$DW$364, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$985, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$985, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$985, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$985

$C$DW$T$986	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$986, DW_AT_name("EK_TM4C123GXL_PWMName")
	.dwattr $C$DW$T$986, DW_AT_type(*$C$DW$T$985)
	.dwattr $C$DW$T$986, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$986, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$986, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$986, DW_AT_decl_column(0x03)


$C$DW$T$987	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$987, DW_AT_name("EK_TM4C123GXL_SDSPIName")
	.dwattr $C$DW$T$987, DW_AT_byte_size(0x01)
$C$DW$365	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$365, DW_AT_name("EK_TM4C123GXL_SDSPI0")
	.dwattr $C$DW$365, DW_AT_const_value(0x00)
	.dwattr $C$DW$365, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x61)
	.dwattr $C$DW$365, DW_AT_decl_column(0x05)

$C$DW$366	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$366, DW_AT_name("EK_TM4C123GXL_SDSPICOUNT")
	.dwattr $C$DW$366, DW_AT_const_value(0x01)
	.dwattr $C$DW$366, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x63)
	.dwattr $C$DW$366, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$987, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$987, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$987, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$987

$C$DW$T$988	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$988, DW_AT_name("EK_TM4C123GXL_SDSPIName")
	.dwattr $C$DW$T$988, DW_AT_type(*$C$DW$T$987)
	.dwattr $C$DW$T$988, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$988, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$988, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$988, DW_AT_decl_column(0x03)


$C$DW$T$989	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$989, DW_AT_name("EK_TM4C123GXL_SPIName")
	.dwattr $C$DW$T$989, DW_AT_byte_size(0x01)
$C$DW$367	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$367, DW_AT_name("EK_TM4C123GXL_SPI0")
	.dwattr $C$DW$367, DW_AT_const_value(0x00)
	.dwattr $C$DW$367, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$367, DW_AT_decl_column(0x05)

$C$DW$368	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$368, DW_AT_name("EK_TM4C123GXL_SPI2")
	.dwattr $C$DW$368, DW_AT_const_value(0x01)
	.dwattr $C$DW$368, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$368, DW_AT_decl_column(0x05)

$C$DW$369	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$369, DW_AT_name("EK_TM4C123GXL_SPI3")
	.dwattr $C$DW$369, DW_AT_const_value(0x02)
	.dwattr $C$DW$369, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$369, DW_AT_decl_column(0x05)

$C$DW$370	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$370, DW_AT_name("EK_TM4C123GXL_SPICOUNT")
	.dwattr $C$DW$370, DW_AT_const_value(0x03)
	.dwattr $C$DW$370, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$370, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$989, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$989, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$989, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$989

$C$DW$T$990	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$990, DW_AT_name("EK_TM4C123GXL_SPIName")
	.dwattr $C$DW$T$990, DW_AT_type(*$C$DW$T$989)
	.dwattr $C$DW$T$990, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$990, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$990, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$990, DW_AT_decl_column(0x03)


$C$DW$T$991	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$991, DW_AT_name("EK_TM4C123GXL_UARTName")
	.dwattr $C$DW$T$991, DW_AT_byte_size(0x01)
$C$DW$371	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$371, DW_AT_name("EK_TM4C123GXL_UART0")
	.dwattr $C$DW$371, DW_AT_const_value(0x00)
	.dwattr $C$DW$371, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x77)
	.dwattr $C$DW$371, DW_AT_decl_column(0x05)

$C$DW$372	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$372, DW_AT_name("EK_TM4C123GXL_UARTCOUNT")
	.dwattr $C$DW$372, DW_AT_const_value(0x01)
	.dwattr $C$DW$372, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x79)
	.dwattr $C$DW$372, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$991, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$991, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$991, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$991

$C$DW$T$992	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$992, DW_AT_name("EK_TM4C123GXL_UARTName")
	.dwattr $C$DW$T$992, DW_AT_type(*$C$DW$T$991)
	.dwattr $C$DW$T$992, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$992, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$992, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$992, DW_AT_decl_column(0x03)


$C$DW$T$993	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$993, DW_AT_name("EK_TM4C123GXL_USBMode")
	.dwattr $C$DW$T$993, DW_AT_byte_size(0x01)
$C$DW$373	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$373, DW_AT_name("EK_TM4C123GXL_USBDEVICE")
	.dwattr $C$DW$373, DW_AT_const_value(0x00)
	.dwattr $C$DW$373, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x81)
	.dwattr $C$DW$373, DW_AT_decl_column(0x05)

$C$DW$374	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$374, DW_AT_name("EK_TM4C123GXL_USBHOST")
	.dwattr $C$DW$374, DW_AT_const_value(0x01)
	.dwattr $C$DW$374, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x82)
	.dwattr $C$DW$374, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$993, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$993, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$993, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$993

$C$DW$T$994	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$994, DW_AT_name("EK_TM4C123GXL_USBMode")
	.dwattr $C$DW$T$994, DW_AT_type(*$C$DW$T$993)
	.dwattr $C$DW$T$994, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$994, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$994, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$994, DW_AT_decl_column(0x03)


$C$DW$T$995	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$995, DW_AT_name("EK_TM4C123GXL_WatchdogName")
	.dwattr $C$DW$T$995, DW_AT_byte_size(0x01)
$C$DW$375	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$375, DW_AT_name("EK_TM4C123GXL_WATCHDOG0")
	.dwattr $C$DW$375, DW_AT_const_value(0x00)
	.dwattr $C$DW$375, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$375, DW_AT_decl_column(0x05)

$C$DW$376	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$376, DW_AT_name("EK_TM4C123GXL_WATCHDOGCOUNT")
	.dwattr $C$DW$376, DW_AT_const_value(0x01)
	.dwattr $C$DW$376, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$376, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$995, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$995, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$995, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$995

$C$DW$T$996	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$996, DW_AT_name("EK_TM4C123GXL_WatchdogName")
	.dwattr $C$DW$T$996, DW_AT_type(*$C$DW$T$995)
	.dwattr $C$DW$T$996, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$996, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$996, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$T$996, DW_AT_decl_column(0x03)


$C$DW$T$997	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$997, DW_AT_name("EK_TM4C123GXL_WiFiName")
	.dwattr $C$DW$T$997, DW_AT_byte_size(0x01)
$C$DW$377	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$377, DW_AT_name("EK_TM4C123GXL_WIFI")
	.dwattr $C$DW$377, DW_AT_const_value(0x00)
	.dwattr $C$DW$377, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x94)
	.dwattr $C$DW$377, DW_AT_decl_column(0x05)

$C$DW$378	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$378, DW_AT_name("EK_TM4C123GXL_WIFICOUNT")
	.dwattr $C$DW$378, DW_AT_const_value(0x01)
	.dwattr $C$DW$378, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x96)
	.dwattr $C$DW$378, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$997, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$997, DW_AT_decl_line(0x93)
	.dwattr $C$DW$T$997, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$997

$C$DW$T$998	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$998, DW_AT_name("EK_TM4C123GXL_WiFiName")
	.dwattr $C$DW$T$998, DW_AT_type(*$C$DW$T$997)
	.dwattr $C$DW$T$998, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$998, DW_AT_decl_file("..\EK_TM4C123GXL.h")
	.dwattr $C$DW$T$998, DW_AT_decl_line(0x97)
	.dwattr $C$DW$T$998, DW_AT_decl_column(0x03)


$C$DW$T$198	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$198, DW_AT_name("GPIOTiva_Config")
	.dwattr $C$DW$T$198, DW_AT_byte_size(0x14)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$193)
	.dwattr $C$DW$379, DW_AT_name("pinConfigs")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("pinConfigs")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/gpio/GPIOTiva.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$379, DW_AT_decl_column(0x15)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$197)
	.dwattr $C$DW$380, DW_AT_name("callbacks")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("callbacks")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/gpio/GPIOTiva.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$380, DW_AT_decl_column(0x17)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$381, DW_AT_name("numberOfPinConfigs")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("numberOfPinConfigs")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/gpio/GPIOTiva.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0xad)
	.dwattr $C$DW$381, DW_AT_decl_column(0x0e)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$382, DW_AT_name("numberOfCallbacks")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("numberOfCallbacks")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/gpio/GPIOTiva.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$382, DW_AT_decl_column(0x0e)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$383, DW_AT_name("intPriority")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("intPriority")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/gpio/GPIOTiva.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$383, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$198, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/gpio/GPIOTiva.h")
	.dwattr $C$DW$T$198, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$T$198, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$198

$C$DW$T$999	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$999, DW_AT_name("GPIOTiva_Config")
	.dwattr $C$DW$T$999, DW_AT_type(*$C$DW$T$198)
	.dwattr $C$DW$T$999, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$999, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/gpio/GPIOTiva.h")
	.dwattr $C$DW$T$999, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$T$999, DW_AT_decl_column(0x03)

$C$DW$T$1000	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1000, DW_AT_type(*$C$DW$T$999)


$C$DW$T$199	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$199, DW_AT_name("I2CTiva_HWAttrs")
	.dwattr $C$DW$T$199, DW_AT_byte_size(0x0c)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$384, DW_AT_name("baseAddr")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("baseAddr")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x90)
	.dwattr $C$DW$384, DW_AT_decl_column(0x12)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$385, DW_AT_name("intNum")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("intNum")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x92)
	.dwattr $C$DW$385, DW_AT_decl_column(0x12)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$386, DW_AT_name("intPriority")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("intPriority")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x94)
	.dwattr $C$DW$386, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$T$199, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$199, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$199

$C$DW$T$1001	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1001, DW_AT_name("I2CTiva_HWAttrs")
	.dwattr $C$DW$T$1001, DW_AT_type(*$C$DW$T$199)
	.dwattr $C$DW$T$1001, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1001, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$T$1001, DW_AT_decl_line(0x95)
	.dwattr $C$DW$T$1001, DW_AT_decl_column(0x03)

$C$DW$T$1002	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1002, DW_AT_type(*$C$DW$T$1001)


$C$DW$T$1003	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$1003, DW_AT_type(*$C$DW$T$1002)
	.dwattr $C$DW$T$1003, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1003, DW_AT_byte_size(0x18)
$C$DW$387	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$387, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$1003


$C$DW$T$211	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$211, DW_AT_name("I2CTiva_Mode")
	.dwattr $C$DW$T$211, DW_AT_byte_size(0x01)
$C$DW$388	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$388, DW_AT_name("I2CTiva_IDLE_MODE")
	.dwattr $C$DW$388, DW_AT_const_value(0x00)
	.dwattr $C$DW$388, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x65)
	.dwattr $C$DW$388, DW_AT_decl_column(0x05)

$C$DW$389	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$389, DW_AT_name("I2CTiva_WRITE_MODE")
	.dwattr $C$DW$389, DW_AT_const_value(0x01)
	.dwattr $C$DW$389, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x66)
	.dwattr $C$DW$389, DW_AT_decl_column(0x05)

$C$DW$390	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$390, DW_AT_name("I2CTiva_READ_MODE")
	.dwattr $C$DW$390, DW_AT_const_value(0x02)
	.dwattr $C$DW$390, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x67)
	.dwattr $C$DW$390, DW_AT_decl_column(0x05)

$C$DW$391	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$391, DW_AT_name("I2CTiva_ERROR")
	.dwattr $C$DW$391, DW_AT_const_value(0xff)
	.dwattr $C$DW$391, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x68)
	.dwattr $C$DW$391, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$211

$C$DW$T$212	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$212, DW_AT_name("I2CTiva_Mode")
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$211)
	.dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x69)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x03)

$C$DW$T$213	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$212)


$C$DW$T$218	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$218, DW_AT_name("I2CTiva_Object")
	.dwattr $C$DW$T$218, DW_AT_byte_size(0x80)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$200)
	.dwattr $C$DW$392, DW_AT_name("mutex")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("mutex")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$392, DW_AT_decl_column(0x19)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$200)
	.dwattr $C$DW$393, DW_AT_name("transferComplete")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("transferComplete")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$393, DW_AT_decl_column(0x19)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$202)
	.dwattr $C$DW$394, DW_AT_name("transferMode")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("transferMode")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$394, DW_AT_decl_column(0x19)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$209)
	.dwattr $C$DW$395, DW_AT_name("transferCallbackFxn")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("transferCallbackFxn")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$395, DW_AT_decl_column(0x19)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$210)
	.dwattr $C$DW$396, DW_AT_name("hwi")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("hwi")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$396, DW_AT_decl_column(0x29)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$213)
	.dwattr $C$DW$397, DW_AT_name("mode")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$397, DW_AT_decl_column(0x1b)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$398, DW_AT_name("currentTransaction")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("currentTransaction")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$398, DW_AT_decl_column(0x19)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$216)
	.dwattr $C$DW$399, DW_AT_name("writeBufIdx")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("writeBufIdx")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$399, DW_AT_decl_column(0x19)

$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$217)
	.dwattr $C$DW$400, DW_AT_name("writeCountIdx")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("writeCountIdx")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$400, DW_AT_decl_column(0x19)

$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$216)
	.dwattr $C$DW$401, DW_AT_name("readBufIdx")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("readBufIdx")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0xac)
	.dwattr $C$DW$401, DW_AT_decl_column(0x19)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$217)
	.dwattr $C$DW$402, DW_AT_name("readCountIdx")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("readCountIdx")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0xad)
	.dwattr $C$DW$402, DW_AT_decl_column(0x19)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$403, DW_AT_name("headPtr")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("headPtr")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$403, DW_AT_decl_column(0x19)

$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$404, DW_AT_name("tailPtr")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("tailPtr")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$404, DW_AT_decl_column(0x19)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$405, DW_AT_name("isOpen")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("isOpen")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$405, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$218, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$T$218, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$218, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$218

$C$DW$T$1005	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1005, DW_AT_name("I2CTiva_Object")
	.dwattr $C$DW$T$1005, DW_AT_type(*$C$DW$T$218)
	.dwattr $C$DW$T$1005, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1005, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/i2c/I2CTiva.h")
	.dwattr $C$DW$T$1005, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$1005, DW_AT_decl_column(0x03)


$C$DW$T$1006	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$1006, DW_AT_type(*$C$DW$T$1005)
	.dwattr $C$DW$T$1006, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1006, DW_AT_byte_size(0x100)
$C$DW$406	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$406, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$1006


$C$DW$T$241	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$241, DW_AT_name("I2C_BitRate")
	.dwattr $C$DW$T$241, DW_AT_byte_size(0x01)
$C$DW$407	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$407, DW_AT_name("I2C_100kHz")
	.dwattr $C$DW$407, DW_AT_const_value(0x00)
	.dwattr $C$DW$407, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x115)
	.dwattr $C$DW$407, DW_AT_decl_column(0x05)

$C$DW$408	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$408, DW_AT_name("I2C_400kHz")
	.dwattr $C$DW$408, DW_AT_const_value(0x01)
	.dwattr $C$DW$408, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x116)
	.dwattr $C$DW$408, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$241, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$241, DW_AT_decl_line(0x114)
	.dwattr $C$DW$T$241, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$241

$C$DW$T$242	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$242, DW_AT_name("I2C_BitRate")
	.dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$242, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$242, DW_AT_decl_line(0x117)
	.dwattr $C$DW$T$242, DW_AT_decl_column(0x03)


$C$DW$T$224	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$224, DW_AT_name("I2C_Config")
	.dwattr $C$DW$T$224, DW_AT_byte_size(0x0c)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$409, DW_AT_name("fxnTablePtr")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("fxnTablePtr")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$409, DW_AT_decl_column(0x19)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$410, DW_AT_name("object")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("object")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$410, DW_AT_decl_column(0x19)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$223)
	.dwattr $C$DW$411, DW_AT_name("hwAttrs")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("hwAttrs")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x180)
	.dwattr $C$DW$411, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$224, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$224, DW_AT_decl_line(0x178)
	.dwattr $C$DW$T$224, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$224

$C$DW$T$1008	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$1008, DW_AT_name("I2C_Config")
	.dwattr $C$DW$T$1008, DW_AT_type(*$C$DW$T$224)
	.dwattr $C$DW$T$1008, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1008, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$1008, DW_AT_decl_line(0x181)
	.dwattr $C$DW$T$1008, DW_AT_decl_column(0x03)

$C$DW$T$1009	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1009, DW_AT_type(*$C$DW$T$1008)


$C$DW$T$1010	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$1010, DW_AT_type(*$C$DW$T$1009)
	.dwattr $C$DW$T$1010, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1010, DW_AT_byte_size(0x24)
$C$DW$412	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$412, DW_AT_upper_bound(0x02)

	.dwendtag $C$DW$T$1010

$C$DW$T$203	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$224)
	.dwattr $C$DW$T$203, DW_AT_address_class(0x20)

$C$DW$T$204	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$204, DW_AT_name("I2C_Handle")
	.dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
	.dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$204, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$204, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$204, DW_AT_decl_column(0x21)


$C$DW$T$234	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$204)
	.dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
$C$DW$413	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$204)

$C$DW$414	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$233)

	.dwendtag $C$DW$T$234

$C$DW$T$235	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$234)
	.dwattr $C$DW$T$235, DW_AT_address_class(0x20)

$C$DW$T$236	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$236, DW_AT_name("I2C_OpenFxn")
	.dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$235)
	.dwattr $C$DW$T$236, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$236, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$236, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$T$236, DW_AT_decl_column(0x17)


$C$DW$T$240	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$240, DW_AT_name("I2C_FxnTable")
	.dwattr $C$DW$T$240, DW_AT_byte_size(0x14)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$227)
	.dwattr $C$DW$415, DW_AT_name("closeFxn")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("closeFxn")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$415, DW_AT_decl_column(0x19)

$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$416, DW_AT_name("controlFxn")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("controlFxn")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x161)
	.dwattr $C$DW$416, DW_AT_decl_column(0x19)

$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$231)
	.dwattr $C$DW$417, DW_AT_name("initFxn")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("initFxn")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x164)
	.dwattr $C$DW$417, DW_AT_decl_column(0x19)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$236)
	.dwattr $C$DW$418, DW_AT_name("openFxn")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("openFxn")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x167)
	.dwattr $C$DW$418, DW_AT_decl_column(0x19)

$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$239)
	.dwattr $C$DW$419, DW_AT_name("transferFxn")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("transferFxn")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$419, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$240, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$240, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$T$240, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$240

$C$DW$T$219	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$219, DW_AT_name("I2C_FxnTable")
	.dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$240)
	.dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$219, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$219, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$T$219, DW_AT_decl_column(0x03)

$C$DW$T$220	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$219)

$C$DW$T$221	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
	.dwattr $C$DW$T$221, DW_AT_address_class(0x20)


$C$DW$T$245	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$245, DW_AT_name("I2C_Params")
	.dwattr $C$DW$T$245, DW_AT_byte_size(0x10)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$202)
	.dwattr $C$DW$420, DW_AT_name("transferMode")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("transferMode")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$420, DW_AT_decl_column(0x19)

$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$209)
	.dwattr $C$DW$421, DW_AT_name("transferCallbackFxn")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("transferCallbackFxn")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$421, DW_AT_decl_column(0x19)

$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$242)
	.dwattr $C$DW$422, DW_AT_name("bitRate")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("bitRate")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0x130)
	.dwattr $C$DW$422, DW_AT_decl_column(0x19)

$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$244)
	.dwattr $C$DW$423, DW_AT_name("custom")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("custom")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0x131)
	.dwattr $C$DW$423, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$245, DW_AT_decl_file("C:/ti/tirtos_tivac_2_16_00_08/products/tidrivers_tivac_2_16_00_08/packages/ti/drivers/I2C.h")
	.dwattr $C$DW$T$245, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$T$245, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$245

$C$DW$T$232	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$232, DW_AT_name("I2C_Params")
